#include<stdio.h>
int main()
{
	int i,j;
	
	//声明二维数组，并赋值 
	//int a[3][4] = {1,2,3,4,5,6,7,8,9,10,11,12};
	//方式二
	int a[3][4] = {
		{1,2,3,4},
		{5,6,7,8},
		{9,10,11,12}
	};
	
	//输出二维数组的内容
	
	for(i=0;i<3;i++)
	{
		for(j=0;j<4;j++)
			printf("%-5d ",a[i][j]);// - 表示左对齐，5表示占5个光标位置 
			
		printf("\n");
	}
		
	return 0;
}
/*
	在Dev-C++5.11中的输出结果为：
--------------------------------------
1     2     3     4
5     6     7     8
9     10    11    12
-------------------------------------- 
*/
	

	
	
		

